Autodesk.Revit.UI.DoubleClickAction.OpenView
Double-Click should open the view.

Autodesk.Revit.UI.DoubleClickAction.Rename
Slow double-click should rename the item.

Autodesk.Revit.UI.DoubleClickAction.EditSchedule
Double-click should edit the schedule.

Autodesk.Revit.UI.DoubleClickAction.ActivateView
Double-click should activate the view.